<a href="https://colab.research.google.com/github/hdpark1208/StudyCode/blob/main/4)%EB%8D%B0%EC%9D%B4%ED%84%B0_%EC%A0%84%EC%B2%98%EB%A6%AC.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#데이터 전처리

In [ ]:
import seaborn as sns

In [ ]:
df = sns.load_dataset('titanic')
df.head()

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

## 누락 데이터 처리

* 누락 데이터 찾기

In [ ]:
df['deck'].value_counts(dropna=False)    #dropna=False 로 인해 'deck' column의 누락 데이터 개수도 알 수 있다

NaN    688
C       59
B       47
D       33
E       32
A       15
F       13
G        4
Name: deck, dtype: int64

In [ ]:
df.head().isnull()    #누락 데이터 일 시 True 반환 (반대 기능인 notnull() 도 있다)

   survived  pclass    sex    age  ...   deck  embark_town  alive  alone
0     False   False  False  False  ...   True        False  False  False
1     False   False  False  False  ...  False        False  False  False
2     False   False  False  False  ...   True        False  False  False
3     False   False  False  False  ...  False        False  False  False
4     False   False  False  False  ...   True        False  False  False

[5 rows x 15 columns]

In [ ]:
df.head().isnull().sum(axis=0)

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           3
embark_town    0
alive          0
alone          0
dtype: int64

In [ ]:
df.isnull().sum(axis=0)

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

* 누락 데이터 제거

In [ ]:
missing_df = df.isnull()
for col in missing_df.columns:
  missing_count = missing_df[col].value_counts()    #각 열의 NaN 개수 파악
  
  try:
    print(col,': ',missing_count[True])    #NaN 값이 있으면 개수 출력
  except:
    print(col,': ',0)    #NaN 값이 없으면 0개 출력

survived :  0
pclass :  0
sex :  0
age :  177
sibsp :  0
parch :  0
fare :  0
embarked :  2
class :  0
who :  0
adult_male :  0
deck :  688
embark_town :  2
alive :  0
alone :  0

In [ ]:
missing_df

     survived  pclass    sex    age  ...   deck  embark_town  alive  alone
0       False   False  False  False  ...   True        False  False  False
1       False   False  False  False  ...  False        False  False  False
2       False   False  False  False  ...   True        False  False  False
3       False   False  False  False  ...  False        False  False  False
4       False   False  False  False  ...   True        False  False  False
..        ...     ...    ...    ...  ...    ...          ...    ...    ...
886     False   False  False  False  ...   True        False  False  False
887     False   False  False  False  ...  False        False  False  False
888     False   False  False   True  ...   True        False  False  False
889     False   False  False  False  ...  False        False  False  False
890     False   False  False  False  ...   True        False  False  False

[891 rows x 15 columns]

In [ ]:
missing_df['deck'].value_counts()

True     688
False    203
Name: deck, dtype: int64

In [ ]:
df_thresh = df.dropna(axis = 1,thresh=500)    #NaN 값이 500개 이상인 '열'을 모두 삭제 ('deck' 해당)
df_thresh.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'embark_town', 'alive',
       'alone'],
      dtype='object')

In [ ]:
print(len(df))
df_age = df.dropna(subset=['age'],how='any',axis=0)    #'age'열의 행 중에서 NaN 값이 있는 모든 행(axis = 0)을 삭제
print(len(df_age))

891
714

* 누락 데이터 치환

In [ ]:
df['age'].head(10)

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: age, dtype: float64

In [ ]:
mean_age = df['age'].mean(axis=0)
mean_age

29.69911764705882

In [ ]:
df['age'].fillna(mean_age,inplace=True)    #평균값으로 치환
df['age'].head(10)

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: age, dtype: float64

In [ ]:
df['embark_town'][825:830]

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829            NaN
Name: embark_town, dtype: object

In [ ]:
most_freq = df['embark_town'].value_counts(dropna=True).idxmax()    #가장 많이 나타난 값
most_freq

'Southampton'

In [ ]:
df['embark_town'].fillna(most_freq,inplace=True)    #최빈값으로 치환
df['embark_town'][825:830]

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829    Southampton
Name: embark_town, dtype: object

In [ ]:
df['embark_town'][829]=None    #초기화
df['embark_town'].fillna(method='ffill',inplace=True)
print(df['embark_town'][825:831])     #전의 데이터값으로 치환
print('\n')
df['embark_town'][829]=None    #초기화
df['embark_town'].fillna(method='bfill',inplace=True)
print(df['embark_town'][825:831])

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829     Queenstown
830      Cherbourg
Name: embark_town, dtype: object


825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829      Cherbourg
830      Cherbourg
Name: embark_town, dtype: object

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """

* 중복 데이터 처리

In [ ]:
import pandas as pd
df = pd.DataFrame({'c1':['a','a','b','a','b'],
                   'c2':[1,1,1,2,2],
                   'c3':[1,1,2,2,2]})
df

  c1  c2  c3
0  a   1   1
1  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

In [ ]:
df_dup = df.duplicated()    #중복되는 행이 나올 수 True 반환
df_dup

0    False
1     True
2    False
3    False
4    False
dtype: bool

In [ ]:
col_dup=df[['c2','c3']].duplicated()    #특정 열 데이터에서 중복값 찾기
col_dup

0    False
1     True
2    False
3    False
4     True
dtype: bool

In [ ]:
df2 = df.drop_duplicates()    #중복되는 행 제거
df2

  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

In [ ]:
df3 = df.drop_duplicates(subset=['c2','c3'])    #특정 열 데이터를 기준으로 중복되는 행 제거
df3

  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2

##데이터 표준화

###단위 환산

In [ ]:
df = pd.read_csv('./auto-mpg.csv',header=None)

In [ ]:
df.columns = ['mpg','cyl','dis','hor','wei','acc','my','ori','name']
df.head()

    mpg  cyl    dis    hor     wei   acc  my  ori                       name
0  18.0    8  307.0  130.0  3504.0  12.0  70    1  chevrolet chevelle malibu
1  15.0    8  350.0  165.0  3693.0  11.5  70    1          buick skylark 320
2  18.0    8  318.0  150.0  3436.0  11.0  70    1         plymouth satellite
3  16.0    8  304.0  150.0  3433.0  12.0  70    1              amc rebel sst
4  17.0    8  302.0  140.0  3449.0  10.5  70    1                ford torino

In [ ]:
mpg_to_kpl = 1.60934/3.78541
df['kpl']=df['mpg']*mpg_to_kpl
df.head()

    mpg  cyl    dis    hor  ...  my  ori                       name       kpl
0  18.0    8  307.0  130.0  ...  70    1  chevrolet chevelle malibu  7.652571
1  15.0    8  350.0  165.0  ...  70    1          buick skylark 320  6.377143
2  18.0    8  318.0  150.0  ...  70    1         plymouth satellite  7.652571
3  16.0    8  304.0  150.0  ...  70    1              amc rebel sst  6.802286
4  17.0    8  302.0  140.0  ...  70    1                ford torino  7.227428

[5 rows x 10 columns]

In [ ]:
df['kpl']=df['kpl'].round(2)
df.head()

    mpg  cyl    dis    hor  ...  my  ori                       name   kpl
0  18.0    8  307.0  130.0  ...  70    1  chevrolet chevelle malibu  7.65
1  15.0    8  350.0  165.0  ...  70    1          buick skylark 320  6.38
2  18.0    8  318.0  150.0  ...  70    1         plymouth satellite  7.65
3  16.0    8  304.0  150.0  ...  70    1              amc rebel sst  6.80
4  17.0    8  302.0  140.0  ...  70    1                ford torino  7.23

[5 rows x 10 columns]

###자료형 변환

* 자료형 확인

In [ ]:
df.dtypes

mpg     float64
cyl       int64
dis     float64
hor      object
wei     float64
acc     float64
my        int64
ori       int64
name     object
kpl     float64
dtype: object

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   mpg     398 non-null    float64
 1   cyl     398 non-null    int64
 2   dis     398 non-null    float64
 3   hor     398 non-null    object
 4   wei     398 non-null    float64
 5   acc     398 non-null    float64
 6   my      398 non-null    int64
 7   ori     398 non-null    int64
 8   name    398 non-null    object
 9   kpl     398 non-null    float64
dtypes: float64(5), int64(3), object(2)
memory usage: 31.2+ KB

* 문자열 >> 실수형

In [ ]:
df['hor'].unique()    # '?' 값 때문에 문자열로 저장되었다

array(['130.0', '165.0', '150.0', '140.0', '198.0', '220.0', '215.0',
       '225.0', '190.0', '170.0', '160.0', '95.00', '97.00', '85.00',
       '88.00', '46.00', '87.00', '90.00', '113.0', '200.0', '210.0',
       '193.0', '?', '100.0', '105.0', '175.0', '153.0', '180.0', '110.0',
       '72.00', '86.00', '70.00', '76.00', '65.00', '69.00', '60.00',
       '80.00', '54.00', '208.0', '155.0', '112.0', '92.00', '145.0',
       '137.0', '158.0', '167.0', '94.00', '107.0', '230.0', '49.00',
       '75.00', '91.00', '122.0', '67.00', '83.00', '78.00', '52.00',
       '61.00', '93.00', '148.0', '129.0', '96.00', '71.00', '98.00',
       '115.0', '53.00', '81.00', '79.00', '120.0', '152.0', '102.0',
       '108.0', '68.00', '58.00', '149.0', '89.00', '63.00', '48.00',
       '66.00', '139.0', '103.0', '125.0', '133.0', '138.0', '135.0',
       '142.0', '77.00', '62.00', '132.0', '84.00', '64.00', '74.00',
       '116.0', '82.00'], dtype=object)

In [ ]:
import numpy as np
df['hor'].replace('?',np.nan,inplace=True)    # '?' 을 NaN 값으로 변경 후
df.dropna(subset=['hor'],axis=0,inplace=True)    #'hor'열에서 NaN 값을 가지는 모든 행을 제거 후
df['hor'] = df['hor'].astype('float')    #문자열을 실수형으로 변환
df['hor'].dtypes

dtype('float64')

* 정수형 >> 범주형

In [ ]:
df['ori'].dtypes

dtype('int64')

In [ ]:
df['ori'].unique()

array([1, 3, 2])

In [ ]:
df['ori']=df['ori'].astype('category')    #범주형 데이터로 변환
df['ori'].dtypes

CategoricalDtype(categories=[1, 2, 3], ordered=False)

In [ ]:
df['my'].sample(3)    #년도 가 정수형으로 되어있지만 범주형 데이터가 적절하다

106    73
52     71
387    82
Name: my, dtype: int64

In [ ]:
df['my']=df['my'].astype('category')
df['my'].dtypes

CategoricalDtype(categories=[70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82], ordered=False)

##범주형 데이터 처리

* 구간 분할(binning)
>연속 변수를 일정한 구간으로 나누고, 각 구간을 범주형 이산 변수로 변환하는 과정

In [ ]:
count, bin_dividers = np.histogram(df['hor'],bins=3)    #넘파이의 histogram 함수를 이용하여 구간의 개수와 경계값을 반환한다
bin_dividers

array([ 46.        , 107.33333333, 168.66666667, 230.        ])

In [ ]:
bin_names=['저출력','보통출력','고출력']    #카테고리 리스트를 만들고
df['hp_bin'] = pd.cut(x=df['hor'],    #판다스의 cut 함수를 이용하여 카테고리화 시킨 열을 추가한다
                      bins=bin_dividers,
                      labels=bin_names,
                      include_lowest=True)
df[['hor','hp_bin']].sample(15)

       hor hp_bin
102   46.0    저출력
315   90.0    저출력
344   64.0    저출력
245   66.0    저출력
264  139.0   보통출력
377   68.0    저출력
89   150.0   보통출력
134  110.0   보통출력
211  120.0   보통출력
107  100.0    저출력
80    86.0    저출력
75   150.0   보통출력
34   105.0    저출력
93   150.0   보통출력
115  145.0   보통출력

###인코딩

* 더미 변수

In [ ]:
hor_dummies = pd.get_dummies(df['hp_bin'])
hor_dummies.sample(20)

     저출력  보통출력  고출력
87     0     1    0
276    0     1    0
339    1     0    0
371    1     0    0
324    1     0    0
180    0     1    0
171    1     0    0
135    1     0    0
117    1     0    0
103    0     1    0
194    1     0    0
296    1     0    0
172    1     0    0
69     0     1    0
68     0     1    0
134    0     1    0
285    0     1    0
263    0     1    0
196    1     0    0
152    1     0    0

In [ ]:
from sklearn import preprocessing
#전처리를 위한 encoder 객체 만들기
label_encoder = preprocessing.LabelEncoder()    #label encoder 생성
onehot_encoder = preprocessing.OneHotEncoder()    #one hot encoder 생성

#label encoder로 문자열 범주를 숫자형 범주로 변환
#print(df['hp_bin'].head(15)) 데이터확인
onehot_labeled = label_encoder.fit_transform(df['hp_bin'].head(15))
print(onehot_labeled)
print(type(onehot_labeled))

#2차원 행렬로 변경
onehot_reshaped = onehot_labeled.reshape(len(onehot_labeled),-1)
print(onehot_reshaped)
print(type(onehot_reshaped))

#희소행렬로 변환
onehot_fitted = onehot_encoder.fit_transform(onehot_reshaped)
print(onehot_fitted)
print(type(onehot_fitted))

[1 1 1 1 1 0 0 0 0 0 0 1 1 0 2]
<class 'numpy.ndarray'>
[[1]
 [1]
 [1]
 [1]
 [1]
 [0]
 [0]
 [0]
 [0]
 [0]
 [0]
 [1]
 [1]
 [0]
 [2]]
<class 'numpy.ndarray'>
  (0, 1)	1.0
  (1, 1)	1.0
  (2, 1)	1.0
  (3, 1)	1.0
  (4, 1)	1.0
  (5, 0)	1.0
  (6, 0)	1.0
  (7, 0)	1.0
  (8, 0)	1.0
  (9, 0)	1.0
  (10, 0)	1.0
  (11, 1)	1.0
  (12, 1)	1.0
  (13, 0)	1.0
  (14, 2)	1.0
<class 'scipy.sparse.csr.csr_matrix'>

## 정규화

In [ ]:
df = pd.read_csv('./auto-mpg.csv',header=None)

In [ ]:
df.columns = ['mpg','cyl','dis','hor','wei','acc','my','ori','name']
df.head()

    mpg  cyl    dis    hor     wei   acc  my  ori                       name
0  18.0    8  307.0  130.0  3504.0  12.0  70    1  chevrolet chevelle malibu
1  15.0    8  350.0  165.0  3693.0  11.5  70    1          buick skylark 320
2  18.0    8  318.0  150.0  3436.0  11.0  70    1         plymouth satellite
3  16.0    8  304.0  150.0  3433.0  12.0  70    1              amc rebel sst
4  17.0    8  302.0  140.0  3449.0  10.5  70    1                ford torino

In [ ]:
df['hor'].replace('?',np.nan,inplace=True)
df.dropna(subset=['hor'],axis=0,inplace=True)
df['hor']=df['hor'].astype('float')
df['hor'].describe()

count    392.000000
mean     104.469388
std       38.491160
min       46.000000
25%       75.000000
50%       93.500000
75%      126.000000
max      230.000000
Name: hor, dtype: float64

In [ ]:
df['hor']=df['hor']/abs(df['hor'].max())    #최대값의 절대값으로 나누어 정규화
df['hor'].describe()

count    392.000000
mean       0.454215
std        0.167353
min        0.200000
25%        0.326087
50%        0.406522
75%        0.547826
max        1.000000
Name: hor, dtype: float64

In [ ]:
df['hor'].replace('?',np.nan,inplace=True)    #최소값을 뺀 후 (최대값-최소값)으로 나누어 정규화 (0<x<1)
df.dropna(subset=['hor'],axis=0,inplace=True)
df['hor']=df['hor'].astype('float')

min_x = df['hor']-df['hor'].min()
min_max = df['hor'].max() - df['hor'].min()
df['hor']=min_x/min_max
df['hor'].describe()

count    392.000000
mean       0.317768
std        0.209191
min        0.000000
25%        0.157609
50%        0.258152
75%        0.434783
max        1.000000
Name: hor, dtype: float64

##시계열 데이터

In [ ]:
df_stock_data = pd.read_csv('stock-data.csv')

In [ ]:
df_stock_data.head()

         Date  Close  Start   High    Low  Volume
0  2018-07-02  10100  10850  10900  10000  137977
1  2018-06-29  10700  10550  10900   9990  170253
2  2018-06-28  10400  10900  10950  10150  155769
3  2018-06-27  10900  10800  11050  10500  133548
4  2018-06-26  10800  10900  11000  10700   63039

In [ ]:
df_stock_data.info()    #'Date' 가 문자열(object)로 저장되어있음을 확인할 수 있다

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    20 non-null     object
 1   Close   20 non-null     int64
 2   Start   20 non-null     int64
 3   High    20 non-null     int64
 4   Low     20 non-null     int64
 5   Volume  20 non-null     int64
dtypes: int64(5), object(1)
memory usage: 1.1+ KB

In [ ]:
df_stock_data['new_Date']=pd.to_datetime(df_stock_data['Date'])    #Timestamp 추가
df_stock_data.head()

         Date  Close  Start   High    Low  Volume   new_Date
0  2018-07-02  10100  10850  10900  10000  137977 2018-07-02
1  2018-06-29  10700  10550  10900   9990  170253 2018-06-29
2  2018-06-28  10400  10900  10950  10150  155769 2018-06-28
3  2018-06-27  10900  10800  11050  10500  133548 2018-06-27
4  2018-06-26  10800  10900  11000  10700   63039 2018-06-26

In [ ]:
type(df_stock_data['new_Date'][0])

pandas._libs.tslibs.timestamps.Timestamp

In [ ]:
df_stock_data.set_index('new_Date',inplace=True)    #Timestamp 열을 행 인덱스로 설정
df_stock_data.drop('Date',axis=1,inplace=True)    #기존의 'Date' 열 삭제
print(df_stock_data.head())
print("")
print(df_stock_data.info())

            Close  Start   High    Low  Volume
new_Date
2018-07-02  10100  10850  10900  10000  137977
2018-06-29  10700  10550  10900   9990  170253
2018-06-28  10400  10900  10950  10150  155769
2018-06-27  10900  10800  11050  10500  133548
2018-06-26  10800  10900  11000  10700   63039

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 20 entries, 2018-07-02 to 2018-06-01
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Close   20 non-null     int64
 1   Start   20 non-null     int64
 2   High    20 non-null     int64
 3   Low     20 non-null     int64
 4   Volume  20 non-null     int64
dtypes: int64(5)
memory usage: 960.0 bytes
None

* Timestamp를 Period로 변환

In [ ]:
dates = ['2019-01-01','2020-03-01','2021-06-21']

In [ ]:
ts_dates = pd.to_datetime(dates)    #문자열의 배열을 Timestamp로 변환

In [ ]:
pr_day = ts_dates.to_period(freq='D')    #Timestamp를 Period로 변환
print(pr_day)

pr_month = ts_dates.to_period(freq='M')   
print(pr_month)

pr_year = ts_dates.to_period(freq='Y')   
print(pr_year)

PeriodIndex(['2019-01-01', '2020-03-01', '2021-06-21'], dtype='period[D]', freq='D')
PeriodIndex(['2019-01', '2020-03', '2021-06'], dtype='period[M]', freq='M')
PeriodIndex(['2019', '2020', '2021'], dtype='period[A-DEC]', freq='A-DEC')

* 시계열 데이터 만들기

In [ ]:
ts_ms = pd.date_range(start='2019-01-01',    # 날짜 범위 시작
                      end=None,              # 날짜 범위 끝
                      periods=6,              # 생성할 Timestamp 개수 
                      freq='QS',             # 시간 간격(MS : 월의 시작일) 
                      tz='Asia/Seoul')       # 시간대(timezone)
print(ts_ms)

DatetimeIndex(['2019-01-01 00:00:00+09:00', '2019-04-01 00:00:00+09:00',
               '2019-07-01 00:00:00+09:00', '2019-10-01 00:00:00+09:00',
               '2020-01-01 00:00:00+09:00', '2020-04-01 00:00:00+09:00'],
              dtype='datetime64[ns, Asia/Seoul]', freq='QS-JAN')

In [ ]:
pr_m = pd.period_range(start='2019-01-01',    # 날짜 범위 시작
                      end=None,              # 날짜 범위 끝
                      periods=6,              # 생성할 Timestamp 개수 
                      freq='H'           # 시간 간격(MS : 월의 시작일) 
                      )       # 시간대(timezone)
print(pr_m)

PeriodIndex(['2019-01-01 00:00', '2019-01-01 01:00', '2019-01-01 02:00',
             '2019-01-01 03:00', '2019-01-01 04:00', '2019-01-01 05:00'],
            dtype='period[H]', freq='H')

###시계열 데이터 활용

* 날짜 데이터 분리

In [ ]:
df_stock_data = pd.read_csv('stock-data.csv')

In [ ]:
df_stock_data['new_Date']=pd.to_datetime(df_stock_data['Date'])    #Timestamp 추가

df_stock_data['Year']=df_stock_data['new_Date'].dt.year
df_stock_data['Month']=df_stock_data['new_Date'].dt.month
df_stock_data['Day']=df_stock_data['new_Date'].dt.day
df_stock_data.head()

         Date  Close  Start   High    Low  Volume   new_Date  Year  Month  Day
0  2018-07-02  10100  10850  10900  10000  137977 2018-07-02  2018      7    2
1  2018-06-29  10700  10550  10900   9990  170253 2018-06-29  2018      6   29
2  2018-06-28  10400  10900  10950  10150  155769 2018-06-28  2018      6   28
3  2018-06-27  10900  10800  11050  10500  133548 2018-06-27  2018      6   27
4  2018-06-26  10800  10900  11000  10700   63039 2018-06-26  2018      6   26

In [ ]:
df_stock_data.set_index('new_Date',inplace=True)
df_stock_data.sample(15)

                  Date  Close  Start   High    Low  Volume  Year  Month  Day
new_Date
2018-07-02  2018-07-02  10100  10850  10900  10000  137977  2018      7    2
2018-06-21  2018-06-21  11200  11350  11750  11200  133002  2018      6   21
2018-06-12  2018-06-12  13200  12200  13300  12050  558148  2018      6   12
2018-06-28  2018-06-28  10400  10900  10950  10150  155769  2018      6   28
2018-06-08  2018-06-08  11950  11950  12200  11800   59258  2018      6    8
2018-06-14  2018-06-14  13450  13200  13700  13150  347451  2018      6   14
2018-06-05  2018-06-05  12150  11800  12250  11800   42485  2018      6    5
2018-06-11  2018-06-11  11950  12000  12250  11950   62293  2018      6   11
2018-06-01  2018-06-01  11900  11800  12100  11750   32062  2018      6    1
2018-06-27  2018-06-27  10900  10800  11050  10500  133548  2018      6   27
2018-06-22  2018-06-22  11300  11250  11450  10750  134805  2018      6   22
2018-06-19  2018-06-19  11300  11850  11950  11300  180656  2018      6   19
2018-06-15  2018-06-15  13400  13600  13600  12900  201376  2018      6   15
2018-06-07  2018-06-07  11950  12200  12300  11900   49088  2018      6    7
2018-06-20  2018-06-20  11550  11200  11600  10900  308596  2018      6   20

In [ ]:
df_stock_data_y =df_stock_data['2018']
print(df_stock_data_y.head())
df_stock_data_ym =df_stock_data.loc['2018-07']
print(df_stock_data_ym.head())
df_stock_data_ym_cols =df_stock_data.loc['2018-07','Start':'Low']
print(df_stock_data_ym_cols)

                  Date  Close  Start   High    Low  Volume  Year  Month  Day
new_Date
2018-07-02  2018-07-02  10100  10850  10900  10000  137977  2018      7    2
2018-06-29  2018-06-29  10700  10550  10900   9990  170253  2018      6   29
2018-06-28  2018-06-28  10400  10900  10950  10150  155769  2018      6   28
2018-06-27  2018-06-27  10900  10800  11050  10500  133548  2018      6   27
2018-06-26  2018-06-26  10800  10900  11000  10700   63039  2018      6   26
                  Date  Close  Start   High    Low  Volume  Year  Month  Day
new_Date
2018-07-02  2018-07-02  10100  10850  10900  10000  137977  2018      7    2
            Start   High    Low
new_Date
2018-07-02  10850  10900  10000